[
  {
    "username": "u/Diminished_2B",
    "text": "100% recommend. Searched the app thoroughly and sent a video of it.",
    "date": "1m ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/shadowbluffy1",
    "text": "Love this guy, Very helpful and genuinely trying to do some good. Didn't find anything, cause I'm a good guy, but it doesn't hurt to make sure.",
    "date": "9h ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Mindless_Collar283",
    "text": "As folks have mentioned above, OP is a super nice dude and isn't just grabbing money and giving you the bare minimum. Very communicative through messaging and answered questions I had about how the app functions and searched both my names and a couple previous locations. $25 is a steal for the peace of mind it provides, with the amount of ghosting I encounter through dating apps I thought for sure an ex put me on there. Seems like ghosting is just ingrained into the culture at this point, good luck out there my guys",
    "date": "9h ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Bipolarable",
    "text": "I was very skeptical at first but this is as legit as it gets. He even is willing to help people out for free. If people like this guy were common then the world would be peaceful. Truly has a good heart probably the most fair person I've ever met online",
    "date": "2d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Dr_uneducated",
    "text": "He's a great guy who genuinely wants to help and bless others! He has a system set up that allowed me to do a search on The Tea App. I wasn't sure if my crazy ex was slandering me. (I have gotten some horrible messages from unknown numbers) I didn't find anything regarding myself, and the peace of mind is great to have now. I highly recommend him!",
    "date": "3d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/NewspaperConfident16",
    "text": "Very helpful and considerate dude. Would easily recommend",
    "date": "4d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/AcanthocephalaLoud98",
    "text": "Nice person, just wants to help out! It was a great relief to see I wasn't on the app and that I'm not getting any matches on dating sites probably just because I'm a weirdo (: and I can live with that! A great help to me and my overall confidence.",
    "date": "4d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/RevolutionaryOne4787",
    "text": "He got me right. It worked. Easy process 🙌🏾 always responded",
    "date": "5d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/SuddenSpaghettiShoes",
    "text": "Totally legit and super helpful. Everything worked out perfectly. Solid experience.",
    "date": "5d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/AnxiousAnxiety477",
    "text": "He's a really friendly and helpful guy! Works quickly, sends a detailed video and does a thorough search. 10/10 would recommend 😂",
    "date": "6d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Big-Construction9712",
    "text": "Quick, informative, and transparent. Process was super easy. Good guy to talk to as well, great experience - would definitely recommend.",
    "date": "6d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Wonderful-Clerk4039",
    "text": "Really great service, the dude running it was super helpful and respectful.",
    "date": "6d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/chillijet",
    "text": "He did a great job, was very quick and helped me use the app. Altogether it was cheap and took about 15 minutes.",
    "date": "6d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/QuantumMcPhysics",
    "text": "Had a great experience, dude is respectful and helped ease some security worries I had. Got me an account within 15 minutes of starting the process. I don't have any posts about me on tea, which I was curious about. I am satisfied with how everything worked out. Fair price for a niche service. If you have any doubts before or after talking to him feel free to DM me and I can give more details.",
    "date": "6d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/No_Exit_647",
    "text": "This guys great, helped within one day and sent a video of the Tea app searching me up. Also luckily was not on there, super responsive and helpful!",
    "date": "7d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/IIMANCHILDII",
    "text": "I messaged the account and they sent me a video of the tea app and searched me up. Luckily I wasn't on there thanks for helping a man out!",
    "date": "10d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/LilithsDaydream",
    "text": "First off, I want to relate to anyone that comes out of necessity to a forum and put your trust on a random avatar in a forum. I totally understand...I'm like you. For all that it's worth, I'm no bot, and I've never met Everythingscoolbro in person. Nor I'd suggest for anyone to trust blindly. However, this man is a MAN OF HIS WORD in a world where words don't mean anything to most people. He's is 100% legit, calm, understanding and above else he got humor. If more men that have his skills would be like him and stand up to these garbage sites and tactics, the world would be just a bit better. He believes on what he does and is a professional at it. If you got any questions about my experience with him, feel free to message me directly, I vouch for him 100%.",
    "date": "12d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Chief8995",
    "text": "I messaged this account privately and they were quick to respond and provided clear info. Unfortunately, they couldn't help with my specific situation but were very upfront about that. Consider that. They were honest and didn't try to sell me on something they couldn't do.",
    "date": "13d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/studentdriver__",
    "text": "I'll start of by saying I don't trust anything on the internet and this seemed too god to be true with all the positives results but ITS NOT. It is 100% legit! It was quick, I provided my info and he searched various formats of my first/last name to ensure it wasn't posted/skewed. He provided a clear video and checked the locations I provided, he's detailed and doing gods work for us men that encounter sour women that try to burn us. BIG THANK YOU FOR everythingscoolbro",
    "date": "17d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Which-Acanthaceae-20",
    "text": "Bro helped me out in a really timely manner, was super kind and understanding, and was all around a good person to have met. Thanks so much for the peace of mind you brought me! I recommend sending this guardian angel a message if you need the help.",
    "date": "21d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/AccomplishedOne8620",
    "text": "Super helpful and was quick to respond and help with their needs",
    "date": "21d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/bwilliam520",
    "text": "This is amazingly helpful. I 100% vouch. Searched for me, no results, and I couldn't be happier.",
    "date": "22d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Icy-Reward-4768",
    "text": "I recommend this service.",
    "date": "22d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/SpecificHandle7832",
    "text": "So unfortunately he was not able to remove my listing but he was very upfront and honest about it and didn't just take my money and run. He's a good guy and I would recommend him to anyone who needs help with this app.",
    "date": "24d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Brnzy",
    "text": "This service was fast, reliable and thorough. Could not have had an easier time or better help dealing with a difficult situation. Solid. Catfish is $80 and they MIGHT find a shadow of posting or some internet clue that there might more you need to find out. Communicative, fast to respond and the video of the search is the cherry on top. You're left with no questions which is why you're looking, sort it?",
    "date": "27d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Low_Coat608",
    "text": "Big huge thanks to this guy! I was very very skeptical at first. We messaged a little. He helped me understand some of the information I didn't quite understand and quickly read over to fast. But he is very patient and an absolute best! I DMed him the needed information and he sent me a full length video of him searching my name and the needed info and everything clarity to my needs. Big thanks! He is very very easy going with helping on price and showing the I needed I for being a student. He gave me all the clarity and I needed and I will give an proper tip with him with a good tip cause he softened my worries! DM him and he will help you guys out! DM me if you dont feel comfortable with any needed information to ask him or any needed information up! But I definitely ofc message him cause he is an absolute pro! Thank you again Bro! And happy holidays",
    "date": "27d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Recent-King-4932",
    "text": "he's the goat man worth every dollar",
    "date": "27d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Radiant-Practice-313",
    "text": "guy is super legit, responded super quick, and even sent me videos of the whole search process. bro, even on christmas day! thank you again fr",
    "date": "28d ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/JCanMakeItHappen",
    "text": "Never thought Id be leaving a review, but good things deserve visibility. He's quick and to the point. He helps put your mind at ease, and best of all, he's not a freaking scam. I Feel free to reach out to me confirm even. He's that good.",
    "date": "1mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/OkAcanthopterygii894",
    "text": "my boy solid. legit and quick with it!",
    "date": "1mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/StraightMagician6982",
    "text": "Easy to work with. Very thorough. Did everything he said he would do. Highly recommend",
    "date": "3mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Sensitive_Grass2475",
    "text": "Super chill dude, highly recommended, legit service got peace of mind",
    "date": "3mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/browning_shooter",
    "text": "This guy is the real deal. I was worried it was a scam but he looks you up quick and sends you what he finds!",
    "date": "3mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/QuarterGreen9976",
    "text": "Dude is actually legit",
    "date": "3mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/Ok_Fly_179",
    "text": "Awesome service . Really looked deep for me and went well into detail.",
    "date": "3mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/bleekfreak",
    "text": "the guy is chill as hell. responded very quickly, let me check out myself and all my friends on the tea app. everyone but me was flagged 😂😂😂 10/10 solid service",
    "date": "3mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/thatsnotrightyoo",
    "text": "Needed a way to check if I was on the app and he was very down to earth and helpful. Well worth it! This has to be the only tea app service that has actual reviews and charges the less of them all too which is crazy again 🌟🌟🌟🌟🌟",
    "date": "3mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  },
  {
    "username": "u/kakejordan",
    "text": "He's the real deal . Vouching for the OP. Very solid and trustworthy dude. Really appreciate his help and would def recommend.",
    "date": "4mo ago",
    "url": "https://www.reddit.com/r/vouchvault/comments/1mi176i/tea_app_search_service_vouch_if_i_helped_you/"
  }
]